In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.read_csv("cha08_datas/sales_by_employee.csv").head(8)

     Date     Name       Customer  Revenue  Expenses
0  1/1/20    Oscar  Logistics XYZ     5250       531
1  1/1/20    Oscar    Money Corp.     4406       661
2  1/2/20    Oscar     PaperMaven     8661      1401
3  1/3/20    Oscar    PaperGenius     7075       906
4  1/4/20    Oscar    Paper Pound     2524      1767
5  1/5/20    Oscar    Paper Pound     2793       624
6  1/1/20  Michael  Logistics XYZ     7172       412
7  1/2/20  Michael    PaperGenius     6362       685

In [66]:
sales = pd.read_csv("cha08_datas/sales_by_employee.csv", parse_dates=["Date"])

sales.head()

/tmp/ipykernel_45385/1607434833.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sales = pd.read_csv("cha08_datas/sales_by_employee.csv", parse_dates=["Date"])

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

In [67]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      26 non-null     datetime64[ns]
 1   Name      26 non-null     object
 2   Customer  26 non-null     object
 3   Revenue   26 non-null     int64
 4   Expenses  26 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 1.1+ KB

In [61]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      26 non-null     datetime64[ns]
 1   Name      26 non-null     object
 2   Customer  26 non-null     object
 3   Revenue   26 non-null     int64
 4   Expenses  26 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 1.1+ KB

In [68]:
sales.pivot_table(index="Date", values=["Revenue", "Expenses"], aggfunc="mean")

               Expenses      Revenue
Date
2020-01-01   637.500000  4293.500000
2020-01-02  1244.400000  7303.000000
2020-01-03  1313.666667  4865.833333
2020-01-04  1450.600000  3948.000000
2020-01-05  1196.250000  4834.750000

In [69]:
sales.pivot_table(index="Date", values=["Revenue", "Expenses"], aggfunc="sum")

            Expenses  Revenue
Date
2020-01-01      3825    25761
2020-01-02      6222    36515
2020-01-03      7882    29195
2020-01-04      7253    19740
2020-01-05      4785    19339

In [70]:
sales.pivot_table(index="Date", values="Revenue", aggfunc="sum")

            Revenue
Date
2020-01-01    25761
2020-01-02    36515
2020-01-03    29195
2020-01-04    19740
2020-01-05    19339

In [72]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values="Revenue",
    aggfunc="sum",
    fill_value=0,
)

Name        Creed  Dwight   Jim  Michael  Oscar
Date
2020-01-01   4430    2639  1864     7172   9656
2020-01-02  13214       0  8278     6362   8661
2020-01-03      0   11912  4226     5982   7075
2020-01-04   3144       0  6155     7917   2524
2020-01-05    938    7771     0     7837   2793

In [74]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values="Revenue",
    aggfunc="sum",
    fill_value=0,
    margins=True,
    margins_name="Total",
)

Name                 Creed  Dwight    Jim  Michael  Oscar   Total
Date
2020-01-01 00:00:00   4430    2639   1864     7172   9656   25761
2020-01-02 00:00:00  13214       0   8278     6362   8661   36515
2020-01-03 00:00:00      0   11912   4226     5982   7075   29195
2020-01-04 00:00:00   3144       0   6155     7917   2524   19740
2020-01-05 00:00:00    938    7771      0     7837   2793   19339
Total                21726   22322  20523    35270  30709  130550

In [77]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values="Revenue",
    aggfunc="count",
    fill_value=0,
)

Name        Creed  Dwight  Jim  Michael  Oscar
Date
2020-01-01      1       1    1        1      2
2020-01-02      2       0    1        1      1
2020-01-03      0       3    1        1      1
2020-01-04      1       0    2        1      1
2020-01-05      1       1    0        1      1

In [78]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values="Revenue",
    aggfunc=["sum", "count"],
    fill_value=0,
)

              sum                            count
Name        Creed Dwight   Jim Michael Oscar Creed Dwight Jim Michael Oscar
Date
2020-01-01   4430   2639  1864    7172  9656     1      1   1       1     2
2020-01-02  13214      0  8278    6362  8661     2      0   1       1     1
2020-01-03      0  11912  4226    5982  7075     0      3   1       1     1
2020-01-04   3144      0  6155    7917  2524     1      0   2       1     1
2020-01-05    938   7771     0    7837  2793     1      1   0       1     1

In [79]:
sales.pivot_table(
    index="Date",
    columns="Name",
    values=["Revenue", "Expenses"],
    aggfunc={"Revenue": "min", "Expenses": "max"},
    fill_value=0,
)

           Expenses                            Revenue                       \
Name          Creed Dwight   Jim Michael Oscar   Creed Dwight   Jim Michael
Date
2020-01-01      548    368  1305     412   661    4430   2639  1864    7172
2020-01-02     1906      0   462     685  1401    5188      0  8278    6362
2020-01-03        0   1321  1923    1772   906       0   2703  4226    5982
2020-01-04     1314      0  1889    1857  1767    3144      0  2287    7917
2020-01-05     1053   1475     0    1633   624     938   7771     0    7837


Name       Oscar
Date
2020-01-01  4406
2020-01-02  8661
2020-01-03  7075
2020-01-04  2524
2020-01-05  2793

In [81]:
sales.pivot_table(
    index=["Name", "Date"],
    values="Revenue",
    aggfunc="sum"
).head(10)

                   Revenue
Name   Date
Creed  2020-01-01     4430
       2020-01-02    13214
       2020-01-04     3144
       2020-01-05      938
Dwight 2020-01-01     2639
       2020-01-03    11912
       2020-01-05     7771
Jim    2020-01-01     1864
       2020-01-02     8278
       2020-01-03     4226

In [82]:
sales.pivot_table(
    index=["Date", "Name"],
    values="Revenue",
    aggfunc="sum"
).head(10)

                    Revenue
Date       Name
2020-01-01 Creed       4430
           Dwight      2639
           Jim         1864
           Michael     7172
           Oscar       9656
2020-01-02 Creed      13214
           Jim         8278
           Michael     6362
           Oscar       8661
2020-01-03 Dwight     11912

In [83]:
sales.head()

        Date   Name       Customer  Revenue  Expenses
0 2020-01-01  Oscar  Logistics XYZ     5250       531
1 2020-01-01  Oscar    Money Corp.     4406       661
2 2020-01-02  Oscar     PaperMaven     8661      1401
3 2020-01-03  Oscar    PaperGenius     7075       906
4 2020-01-04  Oscar    Paper Pound     2524      1767

In [84]:
sales.pivot_table(
    index="Name",
    columns="Date",
    values="Revenue",
    aggfunc="sum",
)

Date     2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05
Name
Creed        4430.0     13214.0         NaN      3144.0       938.0
Dwight       2639.0         NaN     11912.0         NaN      7771.0
Jim          1864.0      8278.0      4226.0      6155.0         NaN
Michael      7172.0      6362.0      5982.0      7917.0      7837.0
Oscar        9656.0      8661.0      7075.0      2524.0      2793.0

In [85]:
sales.pivot_table(
    index="Name",
    columns="Date",
    values="Revenue",
    aggfunc="sum",
).stack()

Name     Date
Creed    2020-01-01     4430.0
         2020-01-02    13214.0
         2020-01-04     3144.0
         2020-01-05      938.0
Dwight   2020-01-01     2639.0
         2020-01-03    11912.0
         2020-01-05     7771.0
Jim      2020-01-01     1864.0
         2020-01-02     8278.0
         2020-01-03     4226.0
         2020-01-04     6155.0
Michael  2020-01-01     7172.0
         2020-01-02     6362.0
         2020-01-03     5982.0
         2020-01-04     7917.0
         2020-01-05     7837.0
Oscar    2020-01-01     9656.0
         2020-01-02     8661.0
         2020-01-03     7075.0
         2020-01-04     2524.0
         2020-01-05     2793.0
dtype: float64

In [86]:
sales_by_customer = sales.pivot_table(
    index=["Customer", "Name"],
    values="Revenue",
    aggfunc="sum"
)

sales_by_customer

                           Revenue
Customer          Name
Average Paper Co. Creed      13214
                  Jim         2287
Best Paper Co.    Dwight      2703
                  Michael    15754
Logistics XYZ     Dwight      9209
                  Michael     7172
                  Oscar       5250
Money Corp.       Creed       5368
                  Jim         8278
                  Oscar       4406
Paper Pound       Dwight      7771
                  Jim         4226
                  Oscar       5317
PaperGenius       Dwight      2639
                  Jim         1864
                  Michael    12344
                  Oscar       7075
PaperMaven        Creed       3144
                  Jim         3868
                  Oscar       8661

In [127]:
sales_by_customer.unstack(level="Name")

                   Revenue
Name                 Creed  Dwight     Jim  Michael   Oscar
Customer
Average Paper Co.  13214.0     NaN  2287.0      NaN     NaN
Best Paper Co.         NaN  2703.0     NaN  15754.0     NaN
Logistics XYZ          NaN  9209.0     NaN   7172.0  5250.0
Money Corp.         5368.0     NaN  8278.0      NaN  4406.0
Paper Pound            NaN  7771.0  4226.0      NaN  5317.0
PaperGenius            NaN  2639.0  1864.0  12344.0  7075.0
PaperMaven          3144.0     NaN  3868.0      NaN  8661.0

In [88]:
video_game_sales = pd.read_csv("cha08_datas/video_game_sales.csv")

video_game_sales

,Name,NA,EU,JP,Other
0,Wii Sports,41.49,29.02,3.77,8.46
1,Super Mario Bros.,29.08,3.58,6.81,0.77
2,Mario Kart Wii,15.85,12.88,3.79,3.31
3,Wii Sports Resort,15.75,11.01,3.28,2.96
4,Pokemon Red/Pokemon Blue,11.27,8.89,10.22,1.00
...,...,...,...,...,...
16561,Woody Woodpecker in Crazy Castle 5,0.01,0.00,0.00,0.00
16562,Men in Black II: Alien Escape,0.01,0.00,0.00,0.00
16563,SCORE International Baja 1000: The Official Game,0.00,0.00,0.00,0.00
16564,Know How 2,0.00,0.01,0.00,0.00
16565,Spirits & Spells,0.01,0.00,0.00,0.00

In [91]:
video_game_sales.melt(id_vars="Name", value_vars="NA", value_name="Sold").head(8)

                       Name variable   Sold
0                Wii Sports       NA  41.49
1         Super Mario Bros.       NA  29.08
2            Mario Kart Wii       NA  15.85
3         Wii Sports Resort       NA  15.75
4  Pokemon Red/Pokemon Blue       NA  11.27
5                    Tetris       NA  23.20
6     New Super Mario Bros.       NA  11.38
7                  Wii Play       NA  14.03

In [94]:
regions = ["NA", "EU", "JP", "Other"]

video_game_sales_by_region = video_game_sales.melt(
    id_vars="Name", value_vars=regions, var_name="Region", value_name="Sales",
)

video_game_sales_by_region

                                                   Name Region  Sales
0                                            Wii Sports     NA  41.49
1                                     Super Mario Bros.     NA  29.08
2                                        Mario Kart Wii     NA  15.85
3                                     Wii Sports Resort     NA  15.75
4                              Pokemon Red/Pokemon Blue     NA  11.27
...                                                 ...    ...    ...
66259                Woody Woodpecker in Crazy Castle 5  Other   0.00
66260                     Men in Black II: Alien Escape  Other   0.00
66261  SCORE International Baja 1000: The Official Game  Other   0.00
66262                                        Know How 2  Other   0.00
66263                                  Spirits & Spells  Other   0.00

[66264 rows x 3 columns]

In [96]:
video_game_sales_by_region.pivot_table(
    index="Name", values="Sales", aggfunc="sum",
).head()

                               Sales
Name
'98 Koshien                     0.40
.hack//G.U. Vol.1//Rebirth      0.17
.hack//G.U. Vol.2//Reminisce    0.23
.hack//G.U. Vol.3//Redemption   0.17
.hack//Infection Part 1         1.26

In [114]:
recipes = pd.read_csv("cha08_datas/recipes.csv")

recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

In [116]:
original_recipes = recipes.copy()

In [117]:
recipes["Ingredients"] = recipes["Ingredients"].str.split(",")

In [118]:
recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  [Apricot preserves,  Dijon mustard,  curry pow...
1      Tomato Basil Salmon  [Salmon filets,  basil,  tomato,  olive oil,  ...
2  Parmesan Cheese Chicken  [Bread crumbs,  Parmesan cheese,  Italian seas...

In [119]:
recipes.explode(column="Ingredients")

                    Recipe         Ingredients
0   Cashew Crusted Chicken   Apricot preserves
0   Cashew Crusted Chicken       Dijon mustard
0   Cashew Crusted Chicken        curry powder
0   Cashew Crusted Chicken     chicken breasts
0   Cashew Crusted Chicken             cashews
1      Tomato Basil Salmon       Salmon filets
1      Tomato Basil Salmon               basil
1      Tomato Basil Salmon              tomato
1      Tomato Basil Salmon           olive oil
1      Tomato Basil Salmon     Parmesan cheese
2  Parmesan Cheese Chicken        Bread crumbs
2  Parmesan Cheese Chicken     Parmesan cheese
2  Parmesan Cheese Chicken   Italian seasoning
2  Parmesan Cheese Chicken                 egg
2  Parmesan Cheese Chicken     chicken breasts

In [120]:
original_recipes

                    Recipe                                        Ingredients
0   Cashew Crusted Chicken  Apricot preserves, Dijon mustard, curry powder...
1      Tomato Basil Salmon  Salmon filets, basil, tomato, olive oil, Parme...
2  Parmesan Cheese Chicken  Bread crumbs, Parmesan cheese, Italian seasoni...

In [121]:
original_recipes["Ingredients"].str.split(",", expand=True)

,0,1,2,3,4
0,Apricot preserves,Dijon mustard,curry powder,chicken breasts,cashews
1,Salmon filets,basil,tomato,olive oil,Parmesan cheese
2,Bread crumbs,Parmesan cheese,Italian seasoning,egg,chicken breasts

In [124]:
original_recipes[["In1", "In2", "In3", "In4", "In5"]] = original_recipes["Ingredients"].str.split(",", expand=True)

In [126]:
original_recipes.drop(columns="Ingredients")

,Recipe,In1,In2,In3,In4,In5
0,Cashew Crusted Chicken,Apricot preserves,Dijon mustard,curry powder,chicken breasts,cashews
1,Tomato Basil Salmon,Salmon filets,basil,tomato,olive oil,Parmesan cheese
2,Parmesan Cheese Chicken,Bread crumbs,Parmesan cheese,Italian seasoning,egg,chicken breasts